nxp-mcuxpresso/mcux-soc-svd/KW43L43Z97/KW43L43Z97.xml
        <register>
          <name>BLE_REG_PST_ANCHR_ADJ_2</name>
          <description>Periodic SW Timer 2: Anchor Adjustment</description>
          <addressOffset>0xA70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>anchr_corr_time</name>
              <description>Anchor Point To Correlation Hit Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>adj_ast_ofst</name>
              <description>Adjusted Anchor Start Time Offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>adj_ast_dir</name>
              <description>Adjusted Anchor Start Time Direction</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Substract adj_ast_ofst from ISO_Intvl_Tmr value counting toward next BIS/CIS event, effectively moving next BIS/CIS anchor point to a earlier time. This is used when the averaged anchr_corr_time value is gradually decreasing, indicating the slave device's local clock is drifting slower.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Add adj_ast_ofst to ISO_Intvl_Tmr value counting toward next BIS/CIS event, effectively delaying next BIS/CIS anchor point to a later time. This is used when the averaged anchr_corr_time value is gradually increasing, indicating the slave device's local clock is drifting faster.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_PST_INTVL_2</name>
          <description>Periodic SW Timer 2: ISO Interval</description>
          <addressOffset>0xA74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>iso_interval</name>
              <description>Configure ISO Interval Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>curr_iso_intvl_tmr</name>
              <description>Current ISO_Intvl_Tmr Timer Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>bit15_0_read_mode</name>
              <description>Bit[15:0] iso_interval field read back value</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>iso_interval field will read back ISO_Interval time of BIS/CIS event being programmed. Unit is 1.25ms.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>iso_interval field will read back curr_iso_intvl_tmr_ofst[10:0] at the time of snapshot_iso_intvl_tmr command being programmed. Unit is 0.25 us.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>snapshot_iso_intvl_tmr</name>
              <description>Take a snapshot of ISO_Intvl_Tmr and offset counter value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_PST_SPC_2</name>
          <description>Periodic SW Timer 2: Spacing</description>
          <addressOffset>0xA78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000096</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>bis_spacing</name>
              <description>Configure BIS Spacing Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>num_bis</name>
              <description>Configure Number of BISes/CISes in BIG/CIG</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_PST_SEL_STRM_2</name>
          <description>Periodic SW Timer 2: Select Stream</description>
          <addressOffset>0xA7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sel_stream</name>
              <description>Select Active Streams</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_PST_SYNC_DLY_2</name>
          <description>Periodic SW Timer 2: Group Sync Delay</description>
          <addressOffset>0xA80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sync_delay</name>
              <description>The BIG_Sync_Delay or CIG_Sync_Delay Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_PST_SE_CTRL_2</name>
          <description>Periodic SW Timer 2: SubEvent Control</description>
          <addressOffset>0xA84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sub_tmr_en</name>
              <description>Enable Periodic SW Timer's Sub_Intvl_Tmr</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>trig_tx_subevt</name>
              <description>Trigger a Packet Tx Event Upon Sub_Intvl_Tmr Timer Expiry</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>trig_rx_subevt</name>
              <description>Trigger a Packet Rx Event Upon Sub_Intvl_Tmr Timer Expiry</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>trig_intr_subevt</name>
              <description>Trigger Interrupt Event Upon Sub_Intvl_Tmr Timer Expiry</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>enable. Either sub_event_intr or ctrl_subevt_intr (if has_ctrl_subevt = 1) will trigger.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>subevt_early_intr_en</name>
              <description>Enable Early Interrupt Assertion For sub_event_intr</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>enable. When enabled, the sub_event_intr will be asserted ealier than subevent anchor point by the specified early_intr_time time.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ctrl_subevt_early_intr_en</name>
              <description>Enable Early Interrupt Assertion For ctrl_subevt_intr</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>enable. When enabled, the ctrl_subevt_intr will be asserted ealier than control subevent anchor point by the specified early_intr_time time.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>has_ctrl_subevt</name>
              <description>Configure To Have Control Subevent In BIS Event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>enable. Enalbing time must meet in order to have control subevent triggered in current BIS event. Only applicable in timer_mode = 0 (BIS timer mode).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_PST_SE_INTVL_2</name>
          <description>Periodic SW Timer 2: SubEvent Interval</description>
          <addressOffset>0xA88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000096</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>sub_interval</name>
              <description>Configure Subevent Interval Time</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>nse</name>
              <description>Configure Number of Subevents Per BIS/CIS Event</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_PST_SE_DIS_2</name>
          <description>Periodic SW Timer 2: SubEvent Disable</description>
          <addressOffset>0xA8C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>dis_remain_subevt</name>
              <description>Disable Remaining Subevents</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_AHBW_FSM_MON_CNTRL</name>
          <description>BLE AHBW FSM Monitor and Reset Control</description>
          <addressOffset>0xE00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rd_st</name>
              <description>rd_st value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_rd_st</name>
              <description>reset rd_st and mst_arb_st</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>td_st</name>
              <description>td_st value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_td_st</name>
              <description>reset td_st and mst_arb_st</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rl_st</name>
              <description>rl_st value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_rl_st</name>
              <description>reset rl_st and mst_arb_st</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mst_arb_st</name>
              <description>mst_arb_st value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>state</name>
              <description>state value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_state</name>
              <description>reset state</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_RX_FSM_MON_CNTRL</name>
          <description>BLE Rx FSM Monitor and Reset Control</description>
          <addressOffset>0xE04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_fsm_state</name>
              <description>rx_fsm_state value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_rx_fsm_state</name>
              <description>reset rx_fsm_state</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_ctl_state</name>
              <description>rx_ctl_state value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_rx_ctl_state</name>
              <description>reset rx_ctl_state</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mem_ctl_state</name>
              <description>mem_ctl_state value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_mem_ctl_state</name>
              <description>reset mem_ctl_state</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TX_FSM_MON_CNTRL</name>
          <description>BLE Tx FSM Monitor and Reset Control</description>
          <addressOffset>0xE08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_fsm_state</name>
              <description>tx_fsm_state value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_tx_fsm_state</name>
              <description>reset tx_fsm_state</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_ctl_st</name>
              <description>tx_ctl_st value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_tx_ctl_st</name>
              <description>reset tx_ctl_st</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_mem_rd_st</name>
              <description>tx_mem_rd_st value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>tx_rd_st</name>
              <description>tx_rd_st value</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_tx_mem_ctl</name>
              <description>reset the 2 state machines in ble_tx_mem_ctl</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_CCM_FSM_MON_CNTRL</name>
          <description>BLE CCM FSM Monitor and Reset Control</description>
          <addressOffset>0xE0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_ctl_st</name>
              <description>ccm_ctl_st value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_pld_blk_rdy_st</name>
              <description>rx_pld_blk_rdy_st value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_ccm_ctl</name>
              <description>reset the 2 state machines in ble_ccm_ctl</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>arb_st</name>
              <description>arb_st value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ccm_st</name>
              <description>ccm_st value</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>reset_btu_ccm_aes</name>
              <description>reset the 2 state machines in ble_ccm_aes</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_DEBUG_CNTRL</name>
          <description>BLE Debug Test Bus Control</description>
          <addressOffset>0xE10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>testbus_cntrl</name>
              <description>BLE debug test bus output control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
